ZigaMahne/STM32U3xx_DFP/CMSIS/SVD/STM32U356.svd
        <register>
          <name>USBSRAM_CHEP_RxTxBD_2</name>
          <displayName>USBSRAM_CHEP_RxTxBD_2</displayName>
          <description>Channel/endpoint transmit buffer descriptor 2</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>ADDR_Tx</name>
              <description>These bits point to the starting address of the packet buffer containing data to be transmitted by the endpoint/channel associated with the USB_CHEP2R register at the next IN token addressed to it. Bits 1 and 0 must always be written as  '00 ' since packet memory is word wide and all packet buffers must be word aligned.
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COUNT_Tx</name>
              <description>These bits contain the number of bytes to be transmitted by the endpoint/channel associated with the USB_CHEPnR register at the next IN token addressed to it.
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBSRAM_CHEP_RxTxBD_2_ALTERNATE</name>
          <displayName>USBSRAM_CHEP_RxTxBD_2_ALTERNATE</displayName>
          <description>Channel/endpoint transmit buffer descriptor 2</description>
          <alternateRegister>USBSRAM_CHEP_RxTxBD_2</alternateRegister>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>ADDR_Rx</name>
              <description>These bits point to the starting address of the packet buffer, which contains the data received by the endpoint/channel associated with the USB_CHEP2R register at the next OUT/SETUP token addressed to it. Bits 1 and 0 must always be written as  '00 ' since packet memory is word wide and all packet buffers must be word aligned.
Note: This table location is used to store two different values, both required during packet reception. The most significant bits contains the definition of allocated buffer size, to allow buffer overflow detection, while the least significant part of this location is written back by the USB peripheral at the end of reception to give the actual number of received bytes. Due to the restrictions on the number of available bits, buffer size is represented using the number of allocated memory blocks, where block size can be selected to choose the trade-off between fine-granularity/small-buffer and coarse-granularity/large-buffer. The size of allocated buffer is a part of the endpoint/channel descriptor and it is normally defined during the enumeration process according to its maxPacketSize parameter value (see  'Universal Serial Bus Specification ').</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COUNT_Rx</name>
              <description>These bits contain the number of bytes received by the endpoint/channel associated with the USB_CHEPnR register during the last OUT/SETUP transaction addressed to it.
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NUM_BLOCK</name>
              <description>These bits define the number of memory blocks allocated to this packet buffer. The actual amount of allocated memory depends on the BLSIZE value as illustrated in  less than xe7 []/&gt;.
</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLSIZE</name>
              <description>This bit selects the size of memory block used to define the allocated buffer area.
- If BLSIZE = 0, the memory block is 2-byte large, which is the minimum block allowed in a half-word wide memory. With this block size the allocated buffer size ranges from 2 to 62 bytes.
- If BLSIZE = 1, the memory block is 32-byte large, which permits to reach the maximum packet length defined by USB specifications. With this block size the allocated buffer size theoretically ranges from 32 to 1024 bytes, which is the longest packet size allowed by USB standard specifications. However, the applicable size is limited by the available buffer memory.
</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBSRAM_CHEP_TxRxBD_3</name>
          <displayName>USBSRAM_CHEP_TxRxBD_3</displayName>
          <description>Channel/endpoint transmit buffer descriptor 3</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>ADDR_Tx</name>
              <description>These bits point to the starting address of the packet buffer containing data to be transmitted by the endpoint/channel associated with the USB_CHEP3R register at the next IN token addressed to it. Bits 1 and 0 must always be written as  '00 ' since packet memory is word wide and all packet buffers must be word aligned.
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COUNT_Tx</name>
              <description>These bits contain the number of bytes to be transmitted by the endpoint/channel associated with the USB_CHEP3R register at the next IN token addressed to it.
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBSRAM_CHEP_TxRxBD_3_ALTERNATE</name>
          <displayName>USBSRAM_CHEP_TxRxBD_3_ALTERNATE</displayName>
          <description>Channel/endpoint transmit buffer descriptor 3</description>
          <alternateRegister>USBSRAM_CHEP_TxRxBD_3</alternateRegister>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>ADDR_Rx</name>
              <description>These bits point to the starting address of the packet buffer, which contains the data received by the endpoint/channel associated with the USB_CHEP3R register at the next OUT/SETUP token addressed to it. Bits 1 and 0 must always be written as  '00 ' since packet memory is word wide and all packet buffers must be word aligned.
Note: This table location is used to store two different values, both required during packet reception. The most significant bits contains the definition of allocated buffer size, to allow buffer overflow detection, while the least significant part of this location is written back by the USB peripheral at the end of reception to give the actual number of received bytes. Due to the restrictions on the number of available bits, buffer size is represented using the number of allocated memory blocks, where block size can be selected to choose the trade-off between fine-granularity/small-buffer and coarse-granularity/large-buffer. The size of allocated buffer is a part of the endpoint/channel descriptor and it is normally defined during the enumeration process according to its maxPacketSize parameter value (see  'Universal Serial Bus Specification ').</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COUNT_Rx</name>
              <description>These bits contain the number of bytes received by the endpoint/channel associated with the USB_CHEP3R register during the last OUT/SETUP transaction addressed to it.
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NUM_BLOCK</name>
              <description>These bits define the number of memory blocks allocated to this packet buffer. The actual amount of allocated memory depends on the BLSIZE value as illustrated in  less than xe7 []/&gt;.
</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLSIZE</name>
              <description>This bit selects the size of memory block used to define the allocated buffer area.
- If BLSIZE = 0, the memory block is 2-byte large, which is the minimum block allowed in a half-word wide memory. With this block size the allocated buffer size ranges from 2 to 62 bytes.
- If BLSIZE = 1, the memory block is 32-byte large, which permits to reach the maximum packet length defined by USB specifications. With this block size the allocated buffer size theoretically ranges from 32 to 1024 bytes, which is the longest packet size allowed by USB standard specifications. However, the applicable size is limited by the available buffer memory.
</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBSRAM_CHEP_RxTxBD_3</name>
          <displayName>USBSRAM_CHEP_RxTxBD_3</displayName>
          <description>Channel/endpoint transmit buffer descriptor 3</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>ADDR_Tx</name>
              <description>These bits point to the starting address of the packet buffer containing data to be transmitted by the endpoint/channel associated with the USB_CHEP3R register at the next IN token addressed to it. Bits 1 and 0 must always be written as  '00 ' since packet memory is word wide and all packet buffers must be word aligned.
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COUNT_Tx</name>
              <description>These bits contain the number of bytes to be transmitted by the endpoint/channel associated with the USB_CHEPnR register at the next IN token addressed to it.
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBSRAM_CHEP_RxTxBD_3_ALTERNATE</name>
          <displayName>USBSRAM_CHEP_RxTxBD_3_ALTERNATE</displayName>
          <description>Channel/endpoint transmit buffer descriptor 3</description>
          <alternateRegister>USBSRAM_CHEP_RxTxBD_3</alternateRegister>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>ADDR_Rx</name>
              <description>These bits point to the starting address of the packet buffer, which contains the data received by the endpoint/channel associated with the USB_CHEP3R register at the next OUT/SETUP token addressed to it. Bits 1 and 0 must always be written as  '00 ' since packet memory is word wide and all packet buffers must be word aligned.
Note: This table location is used to store two different values, both required during packet reception. The most significant bits contains the definition of allocated buffer size, to allow buffer overflow detection, while the least significant part of this location is written back by the USB peripheral at the end of reception to give the actual number of received bytes. Due to the restrictions on the number of available bits, buffer size is represented using the number of allocated memory blocks, where block size can be selected to choose the trade-off between fine-granularity/small-buffer and coarse-granularity/large-buffer. The size of allocated buffer is a part of the endpoint/channel descriptor and it is normally defined during the enumeration process according to its maxPacketSize parameter value (see  'Universal Serial Bus Specification ').</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COUNT_Rx</name>
              <description>These bits contain the number of bytes received by the endpoint/channel associated with the USB_CHEPnR register during the last OUT/SETUP transaction addressed to it.
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NUM_BLOCK</name>
              <description>These bits define the number of memory blocks allocated to this packet buffer. The actual amount of allocated memory depends on the BLSIZE value as illustrated in  less than xe7 []/&gt;.
</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLSIZE</name>
              <description>This bit selects the size of memory block used to define the allocated buffer area.
- If BLSIZE = 0, the memory block is 2-byte large, which is the minimum block allowed in a half-word wide memory. With this block size the allocated buffer size ranges from 2 to 62 bytes.
- If BLSIZE = 1, the memory block is 32-byte large, which permits to reach the maximum packet length defined by USB specifications. With this block size the allocated buffer size theoretically ranges from 32 to 1024 bytes, which is the longest packet size allowed by USB standard specifications. However, the applicable size is limited by the available buffer memory.
</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBSRAM_CHEP_TxRxBD_4</name>
          <displayName>USBSRAM_CHEP_TxRxBD_4</displayName>
          <description>Channel/endpoint transmit buffer descriptor 4</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>ADDR_Tx</name>
              <description>These bits point to the starting address of the packet buffer containing data to be transmitted by the endpoint/channel associated with the USB_CHEP4R register at the next IN token addressed to it. Bits 1 and 0 must always be written as  '00 ' since packet memory is word wide and all packet buffers must be word aligned.
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COUNT_Tx</name>
              <description>These bits contain the number of bytes to be transmitted by the endpoint/channel associated with the USB_CHEP4R register at the next IN token addressed to it.
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBSRAM_CHEP_TxRxBD_4_ALTERNATE</name>
          <displayName>USBSRAM_CHEP_TxRxBD_4_ALTERNATE</displayName>
          <description>Channel/endpoint transmit buffer descriptor 4</description>
          <alternateRegister>USBSRAM_CHEP_TxRxBD_4</alternateRegister>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>ADDR_Rx</name>
              <description>These bits point to the starting address of the packet buffer, which contains the data received by the endpoint/channel associated with the USB_CHEP4R register at the next OUT/SETUP token addressed to it. Bits 1 and 0 must always be written as  '00 ' since packet memory is word wide and all packet buffers must be word aligned.
Note: This table location is used to store two different values, both required during packet reception. The most significant bits contains the definition of allocated buffer size, to allow buffer overflow detection, while the least significant part of this location is written back by the USB peripheral at the end of reception to give the actual number of received bytes. Due to the restrictions on the number of available bits, buffer size is represented using the number of allocated memory blocks, where block size can be selected to choose the trade-off between fine-granularity/small-buffer and coarse-granularity/large-buffer. The size of allocated buffer is a part of the endpoint/channel descriptor and it is normally defined during the enumeration process according to its maxPacketSize parameter value (see  'Universal Serial Bus Specification ').</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COUNT_Rx</name>
              <description>These bits contain the number of bytes received by the endpoint/channel associated with the USB_CHEP4R register during the last OUT/SETUP transaction addressed to it.
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NUM_BLOCK</name>
              <description>These bits define the number of memory blocks allocated to this packet buffer. The actual amount of allocated memory depends on the BLSIZE value as illustrated in  less than xe7 []/&gt;.
</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLSIZE</name>
              <description>This bit selects the size of memory block used to define the allocated buffer area.
- If BLSIZE = 0, the memory block is 2-byte large, which is the minimum block allowed in a half-word wide memory. With this block size the allocated buffer size ranges from 2 to 62 bytes.
- If BLSIZE = 1, the memory block is 32-byte large, which permits to reach the maximum packet length defined by USB specifications. With this block size the allocated buffer size theoretically ranges from 32 to 1024 bytes, which is the longest packet size allowed by USB standard specifications. However, the applicable size is limited by the available buffer memory.
</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBSRAM_CHEP_RxTxBD_4</name>
          <displayName>USBSRAM_CHEP_RxTxBD_4</displayName>
          <description>Channel/endpoint transmit buffer descriptor 4</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>ADDR_Tx</name>
              <description>These bits point to the starting address of the packet buffer containing data to be transmitted by the endpoint/channel associated with the USB_CHEP4R register at the next IN token addressed to it. Bits 1 and 0 must always be written as  '00 ' since packet memory is word wide and all packet buffers must be word aligned.
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COUNT_Tx</name>
              <description>These bits contain the number of bytes to be transmitted by the endpoint/channel associated with the USB_CHEPnR register at the next IN token addressed to it.
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
